const shippingCompanyName = [
  'پست',
  'تیپاکس',
  'اسنپ‌باکس',
  'الوپیک',
];
List invoiceStatus = [1, 2, 3, 8, 9, 100, 900, 901, 800, 444];
List invoiceStatusName = ['ثبت شده', 'آماده ارسال', 'ارسال شده', 'لغو شده', 'مرجوع شده', 'تحویل شده', 'پیش‌فاکتور', 'پیش‌فاکتور', 'از دست رفته', 'حذف شده'];

List commissionStatus = [0, 1, 2];
List commissionStatusName = [
  'تسویه نشده',
  'پرداخت نقدی',
  'سرمایه‌گذاری',
];

const List<String> months = <String>[
  '',
  'فروردین',
  'اردیبهشت',
  'خرداد',
  'تیر',
  'مرداد',
  'شهریور',
  'مهر',
  'آبان',
  'آذر',
  'دی',
  'بهمن',
  'اسفند',
];
