class PermissionAsset {
  static List<String> get check => [''];
  static List<String> get product => ['مشاهده منو', 'افزودن محصول', 'افزودن از اکسل', 'ویرایش', 'ویرایش اطلاعات شاپ', 'حذف/آرشیو', 'افزودن دسته بندی', 'ارسال به مارکت پلیس', 'حذف دسته‌بندی', '', ''];
  static List<String> get productProperty => ['افزودن ویژگی', 'ویرایش ویژگی', 'حذف ویژگی', 'ویرایش ویژگی همه', 'حذف ویژگی همه', 'اختصاص ویژگی به محصول', '', '', '', ''];
  static List<String> get productPrice => ['افزودن قیمت', 'ویرایش قیمت', 'حذف قیمت', 'ویرایش قیمت همه', 'حذف قیمت همه', 'تغییر قیمت پیش‌فرض', '', '', '', ''];

  static List<String> get customer => ['مشاهده منو', 'افزودن', 'افزودن از اکسل', 'مشاهده', 'مشاهده همه مشتریان', 'ویرایش', 'ویرایش همه', '', '', ''];
  static List<String> get crm => ['مشاهده', 'ارتباط جدید', 'مشاهده همه', 'ویرایش', 'ویرایش همه', '', ''];
  static List<String> get campain => ['', '', '', '', '', '', '', '', '', '', ''];

  static List<String> get sell => [
        'ثبت فاکتور',
        'همه مشتریان',
        'مشتریان منتسب شده',
        'مشاهده',
        'ویرایش فاکتور',
        'تغییر به آماده ارسال',
        'تغییر به ارسال شده',
        'تغییر به لغو شده',
        'تغییر به مرجوع شده',
        'تغییر به تحویل شده',
        'اعمال تخفیف',
        'درج هزینه اضافی',
        'دریافت وجه',
        'پرداخت آنلاین',
        'دریافت چک',
        'مشاهده فاکتورهای همه',
        'ویرایش فاکتور همه',
        '',
        '',
        ''
      ];
  static List<String> get preInvoice => ['ثبت پیش‌فاکتور', 'مشاهده', 'ویرایش', 'تبدیل به فاکتور', 'مشاهده همه', 'ویرایش همه', 'تبدیل به فاکتور همه', '', '', ''];
  static List<String> get supplier => ['مشاهده منو', 'افزودن', 'افزودن از اکسل', 'مشاهده', 'ویرایش', 'مشاهده همه', 'ویرایش همه', '', '', ''];
  static List<String> get buy => ['ثبت فاکتور', 'مشاهده', 'ویرایش فاکتور', 'حذف فاکتور', 'پرداخت وجه', 'پرداخت چک', 'مشاهده همه', 'ویرایش همه', 'حذف همه', '', '', ''];
  static List<String> get servicer => ['مشاهده منو', 'افزودن', 'افزودن از اکسل', 'مشاهده', 'ویرایش', 'مشاهده همه', 'ویرایش همه', '', '', ''];
  static List<String> get cost =>
      ['ثبت', 'مشاهده', 'ویرایش', 'دسته‌بندی جدید', 'پرداخت وجه', 'پرداخت چک', 'مشاهده هزینه ارسال', 'مشاهده همه', 'ویرایش همه', 'مشاهده هزینه ارسال همه', 'حذف', 'حذف همه', ''];
  static List<String> get cheque => ['مشاهده منو', 'مشاهده', 'ویرایش', 'پاس', 'حذف', 'مشاهده همه', 'ویرایش همه', 'پاس همه', 'حذف همه', '', '', ''];
  static List<String> get warehose => ['مشاهده منو', 'مشاهده', 'افزودن', 'ویرایش', 'حذف', 'انبارگردانی', 'جابجایی بین انبارها', '', '', ''];
  static List<String> get distribution => ['مشاهده منو', 'مسیریابی', '', '', '', '']; //توزیع
  static List<String> get mikyar => ['مشاهده منو', 'افزودن', 'مشاهده', 'ویرایش مشخصات', 'ویرایش دسترسی', 'مشاهده عملکرد', '', '', ''];
  static List<String> get permission => ['مشاهده', 'ویرایش', '', '', ''];
  static List<String> get report => ['سود و زیان', 'تعدادی', '', '', '', '', '', '', '', '', '', ''];
  static List<String> get other => ['صورت‌حساب'];
  static List<String> get sms => ['مشاهده منو', 'مشاهده پترن‌ها', 'افزودن پترن', 'ویرایش', 'مشاهده همه', 'ویرایش همه', 'تاریخچه ارسال‌ها', 'مشاهده شارژ', 'شارژ مجدد', '', '', '', ''];
  static int get count => 211;
}
